openfoam/manufacturable_vtol/system/snappyHexMeshDict
FoamFile { format ascii; class dictionary; object snappyHexMeshDict; }

castellatedMesh true;
snap true;
addLayers false;

geometry
{
    aircraft
    {
        type triSurface;
        file "CargoUAV_manufacturable_m.stl";
    }
    nearBody
    {
        type box;
        min (-1 -3 -2);
        max (8 3 2);
    }
}

castellatedMeshControls
{
    maxLocalCells 1500000;
    maxGlobalCells 3000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 4;

    features
    (
        { file "CargoUAV_manufacturable_m.eMesh"; level 4; }
    );

    refinementSurfaces
    {
        aircraft
        {
            level (4 4);
            patchInfo
            {
                type wall;
                inGroups (aircraftGroup);
            }
        }
    }

    resolveFeatureAngle 30;
    refinementRegions
    {
    }

    locationInMesh (10 0 5);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 15;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        aircraft { nSurfaceLayers 3; }
    }
    expansionRatio 1.2;
    finalLayerThickness 0.3;
    minThickness 0.05;
    nGrow 3;
    featureAngle 70;
    concaveAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 3;
    nSmoothNormals 5;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 3;
    nLayerIter 80;
}

meshQualityControls
{
    #include "meshQualityDict"
}


mergeTolerance 1e-6;
